Autodesk.AdvanceSteel.DocumentManagement.ModelReport.Show(Advance.AdvDataPanel.IAdvDataPanelManager)
Displays this model report in a custom "Data Panel"
dataPanel:  A valid "Data Panel" needs to be provided here.
If this parameter is null, the default Advance Steel Data Panel will be used instead
Returns: Data Panel Id.

Autodesk.AdvanceSteel.DocumentManagement.ModelReport.Show
Displays this model report in the default Advance Steel Data Panel
Returns: Data Panel Id.